#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python

def product_except_self(nums):
    results = [1] * len(nums)

    prod = 1
    for i in range(1, len(nums)):
        prod *= nums[i - 1]
        results[i] *= prod

    prod = 1
    for i in range(len(nums) - 2, -1, -1):
        prod *= nums[i + 1]
        results[i] *= prod

    return results

nums = [1,2,3,4]
# Output: [24,12,8,6]
print(product_except_self(nums))

nums = [-1,1,0,-3,3]
print(product_except_self(nums))
# Output: [0,0,9,0,0]

#+end_src

#+RESULTS:
: [24, 12, 8, 6]
: [0, 0, 9, 0, 0]


